ИС_СПОРТ_2022/src/Documents/ВыездСпортсменовНаМероприятие/ВыездСпортсменовНаМероприятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыездСпортсменовНаМероприятие</name>
  <registerRecords>InformationRegister.ВыездыСпортсменов</registerRecords>
  <registerRecords>InformationRegister.ВыездыТренеров</registerRecords>
  <attributes>
    <name>Соревнование</name>
    <type>
      <types>CatalogRef.Соревнование</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСоревнования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозвращения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеВыезда</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправление</name>
    <type>
      <types>CatalogRef.ВидыОтправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Финансирование</name>
    <type>
      <types>CatalogRef.Финансирование</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>Инструктор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Тренеры</name>
    <attributes>
      <name>Тренер</name>
      <type>
        <types>CatalogRef.Тренеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыездаТренера</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозвращенияТренера</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Смета</name>
    <attributes>
      <name>ВидРасхода</name>
      <type>
        <types>CatalogRef.ВидыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Catalogs/Спортсмены/Спортсмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спортсмены</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСпортсмена</name>
    <type>
      <types>EnumRef.СтатусыСпортсменов</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонДиспансеризации</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>СовпадаетАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОсобенностиЗдоровья</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяИнвалидностьПоОбщемуЗаболеванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеютсяИнтеллектуальныеНарушения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеЗрения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеСлуха</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеОДА</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПФЗ</name>
    <attributes>
      <name>УникальныйИдентификаторСтрокиПоказателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОбучения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиФизическогоЗдоровья</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Documents/ВыездСпортсменовНаМероприятие/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СметаКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Смета.ТекущиеДанные;
    СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.КоличествоДней;
	Объект.ОбщаяСумма = Объект.Смета.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СметаЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Смета.ТекущиеДанные;
    СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.КоличествоДней;
	Объект.ОбщаяСумма = Объект.Смета.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СметаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
        Элемент.ТекущиеДанные.Количество = Объект.Спортсмены.Количество() + Объект.Тренеры.Количество(); 
		РазницаВДнях = (НачалоДня(Объект.ДатаВозвращения) - НачалоДня(Объект.ДатаВыезда)) / (60 * 60 * 24);
		Если РазницаВДнях < 1 Тогда
			Элемент.ТекущиеДанные.КоличествоДней = 1;
		Иначе
			Элемент.ТекущиеДанные.КоличествоДней = РазницаВДнях;
		КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// {Рарус adilas #23059 -РС Руководитель. Карточка спортсмена.Карточка тренера. 2021.12.13
	// {Рарус dotere #21842 -В методите поле ответственный недоступно  2020.11.06
	Если РольДоступна("ПолныеПрава") Тогда
		 Элементы.Ответственный.Доступность = Истина;
	Иначе 	 
		  Элементы.Ответственный.Доступность = Ложь;
	КонецЕсли;
	// }Рарус dotere #21842 -В методите поле ответственный недоступно 2020.11.06
	// }Рарус adilas #23059 -РС Руководитель. Карточка спортсмена.Карточка тренера. 2021.12.13
	
	Если ПараметрыСеанса.ТекущаяОрганизация.Пустая() Тогда
		Элементы.Организация.Видимость = Истина;
	Иначе
		Объект.Организация = ПараметрыСеанса.ТекущаяОрганизация; 
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли;
	Если Параметры.Свойство("Cоревнование") Тогда
		Объект.Соревнование = Параметры.Cоревнование;
		Объект.Организация = Параметры.Организация;
		Объект.ВидСпорта = Параметры.ВидСпорта;
		Объект.МестоПроведения = Параметры.МестоПроведения;
		Объект.НомерСоревнования = Параметры.НомерСоревнования;
		Объект.ДатаВозвращения = Параметры.ДатаВозвращения;
		Объект.ДатаВыезда = Параметры.ДатаВыезда;
		Объект.Город = Параметры.Город;
		Объект.Финансирование = Параметры.Финансирование;
		Объект.ОснованиеВыезда = Параметры.Основание;

	КонецЕсли;
	ЗаполнитьПериод();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериод()
	
	ПериодВыезда.ДатаНачала = Объект.ДатаВыезда;
	ПериодВыезда.ДатаОкончания = Объект.ДатаВозвращения;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ДатаВыезда > Объект.ДатаВозвращения Тогда
		Отказ = Истина;
	ИначеЕсли Объект.ДатаВозвращения = Дата(1,1,1) Тогда
		Объект.ДатаВозвращения = Объект.ДатаВыезда;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТренерыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
        Элемент.ТекущиеДанные.ДатаВыездаТренера = Объект.ДатаВыезда;
		Элемент.ТекущиеДанные.ДатаВозвращенияТренера = Объект.ДатаВозвращения; 
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодВыездаПриИзменении(Элемент)
	Объект.ДатаВыезда = ПериодВыезда.ДатаНачала;
	Объект.ДатаВозвращения = ПериодВыезда.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура СметаКоличествоДнейПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Смета.ТекущиеДанные;
    СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.КоличествоДней;
	Объект.ОбщаяСумма = Объект.Смета.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СпротсменыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//Отказ = Истина;
	//Если Объект.ДатаВыезда = ДАТА(1,1,1) ИЛИ Объект.ВидСпорта.Пустая() ИЛИ Объект.Организация.Пустая() Тогда 
	//	Предупреждение();  
	//Иначе
	//	Параметр = новый Структура;
	//	Параметр.Вставить("ДатаСреза",Объект.ДатаВыезда);
	//	Параметр.Вставить("ТолькоВыбор",Истина);
	//	Параметр.Вставить("ВидСпорта",Объект.ВидСпорта);
	//	Параметр.Вставить("Организация",Объект.Организация);
	//	Оповещение = Новый ОписаниеОповещения("ОповещениеЗакрытия", ЭтотОбъект);
	//	ОткрытьФорму("Справочник.Спортсмены.Форма.ФормаВыбораСпортсменаПоУчреждению", Параметр, , , , ,Оповещение);
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Предупреждение()
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьПользователю("Заполните спортивное учереждение.");
	КонецЕсли;
	Если Объект.ВидСпорта.Пустая() Тогда
		ОбщегоНазначения.СообщитьПользователю("Заполните вид спорта.");
	КонецЕсли;
	Если ПериодВыезда.ДатаНачала = Дата(1,1,1) ИЛИ ПериодВыезда.ДатаОкончания = Дата(1,1,1) тогда
		ОбщегоНазначения.СообщитьПользователю("Заполнимте дату выезда.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗакрытия(Результат, ДополнительныеПараметры) Экспорт
	
	 ОповещениеЗакрытияНаСервере(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ОповещениеЗакрытияНаСервере(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Спротсмены.ВыделенныеСтроки.Очистить();
	//Объект.Спортсмены.Удалить(Объект.Спортсмены.Количество()-1);
	Если НЕ Результат = Неопределено Тогда
		Параметр = новый Структура;
		Параметр.Вставить("Спортсмен",Результат.Спортсмен);
		Если Объект.Спортсмены.НайтиСтроки(Параметр).Количество() = 0 Тогда
			Объект.Спортсмены.Добавить();
			Строка = Объект.Спортсмены[Объект.Спортсмены.Количество()-1];
			Строка.Спортсмен = Результат.Спортсмен;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Спортсмен " + Результат.Спортсмен + " уже добавлен");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодборСпортсменов(Команда)
	Если Объект.ДатаВыезда = ДАТА(1,1,1) ИЛИ Объект.ВидСпорта.Пустая() ИЛИ Объект.Организация.Пустая() Тогда 
		Предупреждение();  
	Иначе
		Параметр = новый Структура;
		Параметр.Вставить("ДатаСреза",Объект.ДатаВыезда);
		Параметр.Вставить("ТолькоВыбор",Истина);
		Параметр.Вставить("ВидСпорта",Объект.ВидСпорта);
		Параметр.Вставить("Организация",Объект.Организация);
		Оповещение = Новый ОписаниеОповещения("ОповещениеЗакрытия", ЭтотОбъект);
		ОткрытьФорму("Справочник.Спортсмены.Форма.ФормаВыбораСпортсменаПоУчреждению", Параметр, , , , ,Оповещение);
	КонецЕсли;

КонецПроцедуры
